app/controllers/dashboard_controller.rb

UPDATE "members" SET "work" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["work", "TAL_Apparel_Case.pdf"], ["updated_at", "2015-03-18 14:25:32.143106"], ["id", 12]]
---
  def submit

    #@member = Member.find(current_member.id)
    @member = current_member

    @work = params[:work]

    @member.work = @work

    @member.save!