app/controllers/dashboard_controller.rb

  def submit
    @id = current_member.idnumber

    #find current member
    @member = Member.where(:idnumber => @id)
---
SELECT "members".* FROM "members" WHERE "members"."idnumber" = ?  [["idnumber", "1241234"]]