app/controllers/events_controller.rb

  def attend

    @event = Event.find(params[:id])

     if member_signed_in?
       #before_action :authenticate_member!

       @event.attendance = @event.attendance + 1
       @event.save!

       current_member.points = current_member.points + @event.addpoint
       current_member.save!
       redirect_to event_path

     else

       @idnumber = params[:login_params][:idnumber]
       @email = params[:login_params][:email]


       @member = Member.where(:idnumber => @idnumber, :email => @email ).first
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "events" SET "attendance" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["attendance", 1], ["updated_at", "2015-03-11 18:23:55.911777"], ["id", 2]]
UPDATE "members" SET "points" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["points", 1], ["updated_at", "2015-03-14 14:35:27.458371"], ["id", 4]]
SELECT  "members".* FROM "members" WHERE "members"."idnumber" = ? AND "members"."email" = ?  ORDER BY "members"."id" ASC LIMIT 1  [["idnumber", "122733"], ["email", "jacemonje@jace.com"]]

  def create

    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("eventid", "name", "organized_by", "venue", "eventclass", "attendance", "addpoint", "schedule", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)