app/controllers/home_controller.rb

SELECT  "members".* FROM "members"  ORDER BY "members"."id" DESC LIMIT 3
SELECT  "events".* FROM "events"  ORDER BY "events"."id" DESC LIMIT 3
SELECT "events".* FROM "events"
---
  def index

    if member_signed_in?
      redirect_to :controller => 'dashboard', :action => 'index'
    else
      @users = Member.last(3)
      @events = Event.last(3)

      #@workshops = Event.find_by eventclass: 'Workshop'
      #or
      @workshops = Event.all